# 1.  Через цикл for хочу посчитать сумму всех числех, которые я буду вводить самостоятельно , скажем от 13 до числа что я введу сам.


# print("Enter your number")

# a = 13
# yourNumber = int(input())
# sum = 0

# for i in range(a, yourNumber + 2):
#             if sum != i:
#                 print(sum, end=".")
#             sum += i
                   



# 2.  Вывести четные числа из диапазона от 0 до числа который я буду вводить с клавиатуры.


# print("Enter your number")

# a = int(input())

# for i in range(0, a + 1):
#     if i%2 == 0:
#         print(i, end=".")

 


# 3.  Хочу еще посчитать сумму всех чисел, что делятся на 3 от 0 до числа который я буду вводить с клавиатуры


# print("Enter your number")

# a = int(input())
# sum = 0

# for i in range(0, a + 1):
#     if i%3 == 0:
#         print(sum, end=".")
#     sum += i




# S.T.A.LK.ER.

# 1st optinon:
# a = 'S.T.A.LK.ER.'
# print(a, end="")

# 2nd optinon:
# a = 'S.T.A.LK.ER.'
# for i in a:
#     print(i, end="")



