"""1.  Напишите функцию (имя можете выбрать любое) которая будет сумировать все целые числа от первого до второго
параметра, если первый параметр будет больше второго, то поменяйте их местами."""



# def s_of_int(a, b):
#     if a > b:
#         a, b = b, a
#     total = 0
#     for i in range(a, b+1):
#         total += i
#     print("Сумма всех целых чисел от", a, "до", b, "равна: ", total)
#
# s_of_int(5, 2)





"""2.  Напишите функцию, которая будет принимать на себя 2 параметра в виде имени и фамилии студента, а выводить на 
экран будет запись вида Привет Имя Фамилия."""



# def student_name(x, y):
#     print('Привет,', x, y, end=' ')
#
#
# student_name(input('Ваше имя:'), input('Ваша Фамилия:'))





""" 3.  Создайте функцию которая позваляет посчитать периметр и площадь квадрата (значения пользователь вводит)"""



# def sqr_calc(side):
#     p = side * 4
#     a = side ** 2
#
#     return p, a
#
#
# side = int(input("Введите длину стороны квадрата: "))
# p, a = sqr_calc(side)
# print("Периметр квадрата =", p)
# print("Площадь квадрата =", a)


