"""1. Напишите программу, которая будет в лесенку выстраивать числа от произвольного положительного числа .
То есть если я введу цифру 5 то у меня получится
1
12
123
1234
12345"""

# a = int(input())
# for i in range(1, a + 1):
#     for j in range(1, i + 1):
#         print(j, end='')
#     print()


"""2. Постройте мне следующую картину. (квадратная таблица умножения)

1 2 3 4 5 6 7 8 9
24
3 6
4 8
5 10
6 12...."""

# for i in range(1, 10):
#     for j in range(1, 10):
#         print(i*j, end=' ')
#     print()
