# 1.  Найти сумму чисел от 1 до 100 (результат в консоль конечно же).

# a = 0
# b = 0

# while a <=100:
#     b += a
#     a += 1
#     print(b, end=" ")


# 2.  Вывести на экран все четные значения от 1 до 100.

# a = 0

# while a <= 99:
#     a += 2
#     print(a, end=".")



# 3.  Вывести на экран все нечетные значения от 1 до 300.

# a = 300
# b = 1

# while b <= a:
#     if b%2 == 1:
#         print(b, end=".")
#     b += 1




