# 1.  Напишите программу которая будет сравнивать 2 числа , одно из которых вводится произвольно пользователем.  Если число будет больше 100, вывести на экран сообщение о том, что число больше 100, если число будет меньше 100 и при этом больше 50 вывести на экран сообщение о том, что число больше 50 но меньше 100 и последнее если число меньше 50 вывести на экран сообщение число меньше 50. #

#a = int(input())
#b = 100
#
#if a > b:
#    print("a > 100")
#elif a < b and a > 50:
#    print("a > 50 but a < 100")
#elif a < 50:
#    print("a < 50") #



# 2.  Написать программу которая позволяет узнать, есть ли пользователю 18 лет и можем ли мы пропустить его на наш ресурс, другими словами, если пользователю есть 18 лет, то вывести сообщение входи, если нет, вывести сообщение о запрете. #

#print("how old are you?")
#age = int(input())
#
#if age >= 18:
#    print("access allowed")
#else:
#    print("access denied") #



# 3.  Пользователь вводит два целых числа. Выведите меньшее из них. # 

#print("type 2 integers")
#num1 = int(input())
#num2 = int(input())
#if num1 < num2:
#    print(num1)
#elif num2 < num1:
#    print(num2) #